Repository: loginom/loginom-l10n-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Группа отчетов
en: Report group

source: Ограничение порта
en: Port constraint

source: Описание ограничения сокета уже проинициализировано
en: Socket constraint definition already initialized

source: Не задана ссылка на порт
en: No reference to port specified

source: Не получили ответ по URL
en: Failed to get response from URL

source: Ограничение сокета уже проинициализировано
en: Socket constraint already initialized

source: Описание сокета в списке не найдено
en: Socket definition not found in the list

source: Описание сокета уже проинициализировано
en: Socket definition already initialized

source: Нельзя динамически добавить не множественный порт
en: Failed to add non-multiple port dynamically

source: Нельзя удалить не динамический порт
en: Failed to delete non-dynamic port

source: Порт в списке не найден
en: Port not found in the list

source: Нельзя изменять свойства парсера в процессе разбора
en: Failed to change parser properties during parsing

source: Ошибка выполнения запроса 1С
en: Error executing 1C query

source: Достигнуто максимальное количество множественного порта
en: Maximum multiple port count reached

source: Сокет уже проинициализирован
en: Socket already initialized

source: Порт не настроен
en: Port not configured

source: Текущий модуль
en: Current module

source: Удаление производного компонента "%s"
en: Delete "%s" Derived Component

source: Узел "%s" не принадлежит текущему модулю
en: "%s" node does not belong to the current module

source: Подмодель не принадлежит текущему сценарию
en: Supernode does not belong to the current workflow

source: Создание производного компонента по данному узлу невозможно
en: Creation of derived component for this node is not possible

source: Не зарегистрирована реализация SAX-парсера для интерфейса %s
en: SAX parser implementation for %s interface not registered

source: локальный компонент
en: local component

source: Активация входов узла
en: Activating node inputs

source: Активация узлов
en: Activating nodes

source: Добавлен вход "%s" к узлу "%s"
en: "%s" input added to "%s" node

source: Добавлен выход "%s" к узлу "%s"
en: Output "%s" Added to Node "%s"

source: Компонент
en: Component

source: Скопирован элемент "%s"
en: "%s" Element Copied

source: Удалены элементы
en: Elements deleted

source: Удален вход "%s" узла "%s"
en: "%s" Input of "%s" Node Deleted

source: Ошибка в строке %d, позиция %d при разборе файла '%s': %s
en: Error in row %d, position %d while parsing '%s' file: %s

source: Удален выход "%s" узла "%s"
en: Output "%s" Deleted from Node "%s"

source: Зависимые узлы
en: Dependent nodes

source: Обработка запроса отменена
en: Request processing cancelled

source: При активации узлов возникла ошибка
en: Error occurred while activating nodes

source: Все узлы сценария заблокированы
en: All workflow nodes locked

source: Узел "%s" уже находится в состоянии настройки порта
en: "%s" node already in the port configuring state

source: Узел "%s" не может быть активирован, т.к. рекурсивно зависит от активации самого себя
en: "%s" node cannot be activated because it recursively depends on its own activation

source: Изменился тип данных столбца "%s"
en: "%s" column data type changed

source: Базовый компонент не проинициализирован
en: Base component not initialized

source: Пакет уже содержит опубликованный узел с именем "%s"
en: The package already contains the published node with "%s" name

source: Необработанное исключение при разборе файла '%s': %s
en: Unhandled exception parsing '%s' file: %s

source: Ошибка при определении имени пакета. Возможно, источник сообщения был удален.
en: Error in determining package name. Message source could have been deleted.

source: Узел "%s" находится в неактивной ветви условия
en: "%s" node is in the inactive condition branch

source: Некорректный Cookie блокировки критической секции сценария
en: Invalid Cookie for critical workflow section locking

source: Некорректный Cookie блокировки узлов сценария
en: Invalid Cookie for workflow nodes locking

source: Сценарий содержит %d заблокированных узлов
en: Workflow contains %d locked nodes

source: Узел уже проинициализирован
en: Node already initialized

source: Обнаружено несколько переменных с именем "%s"
en: Multiple variables with "%s" name found

source: Конфигурация узла не проинициализирована
en: Node configuration not initialized

source: Узел не принадлежит сценарию
en: Node does not belong to the workflow

source: Ошибка при разборе потока в строке %d, позиция %d: %s
en: Error parsing stream in row %d, position %d: %s

source: Запрашиваемый узел не принадлежит сценарию
en: The requested node does not belong to the workflow

source: У узла "%s" не задан компонент
en: No component specified for "%s" node

source: У узла "%s" изменилось количество выходных портов
en: Number of output ports was changed for "%s" node

source: У узла "%s" изменился тип выходного порта "%s"
en: Type of output "%1:s" port was changed for "%0:s" node

source: Изменились параметры узла дерева "%s"
en: Parameters of "%s" tree node were changed

source: Несовместимый компонент: не совпадает список портов узла
en: Incompatible component: node port list does not match

source: Не задано имя опубликованного узла
en: No published node name specified

source: К обязательному порту "%s" не подключена связь
en: Link to the required port "%s" does not exist

source: Необработанное исключение при разборе потока: %s
en: Unhandled exception parsing stream: %s

source: Не удалось загрузить конфигурацию узла
en: Failed to load the node configuration

source: Изменился тип данных переменной "%s"
en: "%s" variable data type changed

source: Компонент узла "%s" неисправен
en: "%s" node component is malfunctioning

source: Активация узла "%s" GUID=%s
en: Activating "%s" GUID=%s node

source: Успешно активирован узел "%s" GUID=%s
en: Successfully activated "%s" GUID=%s node

source: Ошибка при разборе потока: неизвестная кодировка %s
en: Stream parsing error: unrecognized %s encoding

source: Активация узла "%s" GUID=%s Пакет=%s
en: Activate node "%s" GUID=%s Package=%s

source: Успешно активирован узел "%s" GUID=%s Пакет=%s
en: Node "%s" GUID=%s Package=%s successfully activated

source: Активирован порт "%s" узла "%s" GUID=%s Количество строк=%d
en: Port "%s" of node "%s" activated GUID=%s Row count=%d

source: Активирован порт "%s" узла "%s" GUID=%s Количество строк недоступно
en: Port "%s" of node "%s" GUID=%s activated Row count unavailable

source: Деактивирован узел "%s" GUID=%s
en: "%s" GUID=%s node deactivated

source: Ошибка активации узла "%s" GUID=%s
en: Error activating "%s" node, GUID=%s

source: Ошибка загрузки узла "%s" GUID=%s
en: Error loading node "%s" GUID=%s

source: Ошибка активации узла "%s" GUID=%s Пакет=%s
en: Error while activating node "%s" GUID=%s Package=%s

source: Пакет=%s
en: Package=%s

source: У узла "%s" восстановлена исходная конфигурация
en: Initial configuration of "%s" node reset

source: Ошибка при разборе потока: неизвестная кодировка
en: Stream parsing error: unrecognized encoding

source: Восстановление конфигурации из резервной копии
en: Restoring backup configuration

source: В текущем контексте нельзя создать компонент подмодели
en: Failed to create the supernode component In the current context

source: Невозможно создать входной порт для порта "%s"
en: Failed to create input port for "%s" port

source: Невозможно создать выходной порт для порта "%s"
en: Failed to create output port for "%s" port

source: Запрещено изменение переменной %s
en: Changing variable %s is forbidden

source: Задана неизвестная кодировка %s
en: Unknown %s encoding set

source: Запрещено изменение списка переменных
en: Variable list change forbidden

source: Не активен исходный узел "%s" GUID=%s
en: Source "%s" GUID=%s node is not active

source: Не доступен исходный узел "%s" GUID=%s
en: Source "%s" GUID=%s node not available

source: Не найден исходный узел GUID=%s
en: Source GUID=%s node not found

source: Не задана ссылка на узел
en: No reference to node specified

source: Ссылка на узел
en: Reference to node

source: Ошибка в строке %d, позиция %d при выполнении запроса к URL '%s': %s
en: Error in row %d, position %d when executing request to URL '%s': %s

source: Редактирование служебной переменной запрещено
en: Service variable editing is forbidden

source: Не удалось инициализировать переменные типа %s
en: Failed to initialize %s variables

source: Недопустимый тип переменных: %s
en: Invalid variable type: %s

source: Ошибка в строке %d, позиция %d при выполнении запроса к URL '%s': ответ сервера не является XML-файлом
en: Error in row %d, position %d when executing request to URL '%s': server response is not XML file

source: Число столбцов
en: Column count

source: Переменные сценария
en: Workflow Variables

source: Настройка переменных, используемых в текущем сценарии
en: Configure variables used in the current workflow

source: Переменная "%s" не принадлежит текущему компоненту
en: "%s" variable does not belong to the current component

source: Значение "%s" входной переменной "%s" не соответствует заданным ограничениям
en: "%s" value of the input variable "%s" does not match the specified constraints

source: Необработанное исключение при разборе запроса к URL '%s': %s
en: Unhandled exception parsing request to URL '%s': %s

source: Переменных
en: Variables

source: Не определен входной набор данных
en: No input dataset defined

source: Общие
en: Common

source: Табличное представление
en: Table View

source: Контекст SAX-парсера libxml2 не создан
en: Context of SAX parser libxml2 not created

source: В матрице значений не найдена строка с индексом %d
en: The string with index %d is not found in the matrix of values

source: Недопустимое количество столбцов во входной матрице значений: %d; необходимо: %d
en: Invalid column count in the input matrix of values: %d; required: %d

source: Недопустимое количество элементов во входном массиве: %d; необходимо: %d
en: Invalid element count in the input array: %d; required: %d

source: Недопустимое количество строк в матрице значений переменных: %d
en: Invalid row count in the variable value matrix: %d

source: Недопустимое количество элементов в массиве значений узла %s: %d; необходимо: %d
en: Invalid element count in the array of %s node values: %d; required: %d

source: У узла "%s" изменилось количество входных портов
en: Number of input ports was changed for "%s" node

source: У узла "%s" изменился тип входного порта "%s"
en: Type of "%1:s" input port was changed for "%0:s" node

source: В наборе данных обнаружен столбец "%s", которого не существовало на момент публикации
en: "%s" column nonexisting at the moment of publication was detected in dataset

source: Несбалансированная операция извлечения
en: Unbalanced extraction operation

source: В дереве данных обнаружен узел "%s", которого не существовало на момент публикации
en: "%s" node nonexisting at the moment of publication was detected in data tree

source: Невозможно создать циклическую связь между узлами
en: Circular link between nodes is not possible

source: Ко входному порту "%s" узла "%s" уже подключена связь
en: Link to the input port "%s" of "%s" node already exists

source: Не удалось восстановить связь, подключенную ко входу узла "%s"
en: Failed to restore link to the input of "%s" node

source: Колонка "%s" для разбиения по столбцу должна быть логического типа данных
en: "%s" column for partition by column must be related to the logical data type

source: Отсутствует колонка %s для разбиения по столбцу
en: No %s column for partition by column

source: Не задана колонка для разбиения по столбцу
en: No column for partition by column set

source: У колонки "%s" для разбиения по столбцу изменено назначение
en: Usage type was changed for "%s" column for partition by column

source: Невозможно денормализировать один элемент. На входе должен быть массив из %d элементов.
en: Failed to denormalize a single element. Array from %d elements must be at the input.

source: Вызов EndSynchronize без соответствующего BeginSynchronize
en: EndSynchronize call without corresponding BeginSynchronize

source: Размер массива '%s' %d не равен ожидаемому размеру массива %d
en: Size %1:d of '%0:s' array not equal to the expected size of array %2:d

source: Удаляемый диапазон выходит за допустимые пределы. Заданы: начальный индекс %d, длина диапазона %d. Индекс последней удаляемой колонки %d больше индекса последней доступной для удаления колонки %d.
en: The range to be deleted is out of limits. The following values are given: start index %d, range length %d. The index of the last deleted column %d exceeds the index of the last deleted column %d.

source: Неудаляемый фактор "%s" не может быть исключен
en: Irremovable factor "%s" cannot be excluded

source: Курсор итератора флагов не указывает на значение
en: The flag iterator cursor does not indicate value

source: Невозможно денормализировать один элемент. Для колонки "%s" должен денормализироваться массив из %d элементов.
en: Failed to denormalize a single element. Array from %1:d elements must be denormalized for "%0:s" column.

source: Невозможно выделить память для кэшированного нормализированного источника данных
en: Failed to allocate memory for cached normalized data source

source: Размер кэша недостаточен для хранения строки нормализированных данных
en: Insufficient cache size to store normalized data string

source: Вызов EndUpdate без соответствующего BeginUpdate
en: EndUpdate call without corresponding BeginUpdate

source: Во время вызова вложенного BeginUpdate кэш нормализированного набора данных должен быть заблокирован
en: Calling nested BeginUpdate cache of the normalized dataset must be locked

source: Размер массива %s %d не равен ожидаемому %d
en: Size %1:d of %0:s array not equal to the expected %2:d

source: Ошибка при добавлении фактора "%s": число выходных колонок нормализатора %d не соответствует ожидаемому %d
en: Error adding "%s" factor: the output column count of %d normalizer does not match the expected %d

source: Неподдерживаемый тип запрашиваемого нормализированного набора данных
en: Unsupported type of the requested normalized dataset

source: Неподдерживаемый тип данных нормализаторов пренормализированной строки
en: Unsupported type of the normalizer data of the normalized string

source: Размер строки результатов %d меньше чем размер нормализированной строки %d
en: The size of the results string %d is less than the size of the normalized string %d

source: Фабрика для данного формата нормализированного набора данных уже была зарегистрирована
en: Factory for this normalized dataset format has already been registered

source: Фабрика для данного формата нормализированного набора данных не была зарегистрирована
en: Factory for this normalized dataset format has not been registered

source: Недопустимый тип умножаемого фактора
en: Invalid multiplied factor type

source: Не учтена поправка коэффициентов при денормализации
en: Denormalization coefficients correction ignored

source: Невозможно денормализовать значение дискретного поля
en: Failed to denormalize the discrete field value

source: Ошибка при разборе потока в строке %d, позиция %d: источник не является XML-файлом или имеет некорректный синтаксис
en: Error parsing stream in row %d, position %d: the source is not XML file or has incorrect syntax

source: Нормализируемое значение меньше минимума диапазона значений
en: The normalized value is less than the range minimum value

source: Нормализируемое значение больше максимума диапазона значений
en: The normalized value is more than the range maximum value

source: Денормализируемое значение меньше минимума диапазона значений
en: The denormalized value is less than the range minimum value

source: Денормализируемое значение больше максимума диапазона значений
en: The denormalized value is more than the range maximum value

source: Не определена опорная категория, используемая в нормализаторе
en: The reference category used in the normalizer is not defined

source: Пренормализированный индекс: %d вне допустимого диапазона [%d, %d]
en: Prenormalized index: %d is out of allowable range [%d, %d]

source: к
en: to

source: к среднему
en: to mean

source: к среднему из предыдущих
en: to mean from previous

source: к среднему из последующих
en: to mean from subsequent

source: Выбранный тип нормализации "%s" не поддерживается настройками нормализации Min-Max
en: The selected "%s" normalization type is not supported by Min-Max normalization settings

source: Невозможно рассчитать максимум/минимум для настройки нормализации диапазона, колонка "%s"
en: Failed to calculate the maximum/minimum value for the range normalization settings, "%s" column

source: Невозможно рассчитать делитель для нормализации отношения, колонка "%s"
en: Failed to calculate divisor to normalize relations, "%s" column

source: Выбранный тип нормализации "%s" не поддерживается настройками нормализации отношения
en: The selected "%s" normalization type is not supported by the relation normalization settings

source: Выбранный параметр статистики "%s" нельзя использовать как делитель в настройках нормализации отношения
en: Use of the selected statistics parameter "%s" as divisor in the relation normalization settings is not allowed

source: Устанавливаемый тип статистического показателя "%s" не может быть использован в качестве делителя нормализации отношения
en: The set statistic indicator "%s" cannot be used as relation normalization divisor

source: Запрос колонки нормализированной матрицы не поддерживается
en: Normalized matrix column request not supported

source: Индекс устанавливаемой колонки %d отсутствует в хэше Accessor'ов
en: No index of the set column %d in Accessor hash

source: Не найден допустимый тип нормализации
en: No valid normalization type found

source: Устанавливаемый тип контроля диапазона "%s" недопустим для данного нормализатора
en: The set "%s" type of range control is not valid for this normalizer

source: Используется недопустимый конструктор параметров нормализации
en: Invalid normalization parameter constructor used

source: Генерируемый фактор
en: Generated factor

source: Получить значение ячейки столбца
en: Get column cell value

source: Для столбца "%s" нет доступных типов нормализации
en: No available normalization types for "%s" column

source: Недопустимый индекс фактора %d (доступный диапазон [%d, %d])
en: Invalid factor index %d (available range is [%d, %d])

source: Список уникальных значений для столбца "%s" изменился, требуется перенастройка компонента
en: The unique values list for "%s" column changed; component reconfiguration required

source: Недопустимый индекс запрашиваемых стат. показателей
en: Invalid index of the requested statistical indicators

source: Данные входного набора несовместимы с настройками нормализации
en: Input dataset is not compatible with normalization settings

source: Передан пустой провайдер статистической информации колонок
en: Null provider of the statistic columns information was passed

source: Вендор настраиваемых полей с нормализацией не установлен
en: Vendor of configurable fields with normalization not installed

source: Вызван неправильный конструктор коллекции колонок
en: Invalid column collection constructor called

source: Подготовка входного набора данных
en: Preparing input dataset

source: Создание нормализированного набора данных
en: Creating normalized dataset

source: Подготовка выходного набора данных
en: Preparing output dataset

source: При запросе нормализованного набора произошли ошибки
en: Errors occurred while requesting normalized dataset

source: Нельзя запросить индекс уникального значения у недискретной колонки
en: Failed to query the unique value index of non-discrete column

source: "%s" отсутствует в списке настроенных уникальных значений (колонка "%s", строка %d)
en: "%s" not found in the list of configured unique values ("%s" column, string %d)

source: При запросе токена ответ не является JSON который содержит токен
en: Token request response is not a token-containing JSON

source: Токен не содержит клейм %s
en: The token does not contain the %s claim

source: Информация о пользователе не содержит свойство %s
en: User info does not contain the %s property

source: Токен не содержит списка ролей с клеймом %s
en: The token does not contain the list of roles with the %s claim

source: Ошибка получения токена. %s
en: Error receiving token. %s

source: Формат ответа на запрос аутентификации
en: Authentication request response format

source: Клейм полного имени пользователя в токене
en: Full username claim in token

source: В документе отсутствует корневой элемент
en: No root element in the document

source: Клейм имени пользователя в токене
en: Username claim in token

source: Список имен ролей для сопоставления ролям пользователя
en: List of role names to map to user roles

source: Параметр с индексом %d отсутствует в списке
en: Parameter with index %d is not listed

source: Параметр с индексом %d отсутствует в списке ограничений
en: Parameter with index %d not found in the constraints list

source: Параметр с индексом %d добавляется более одного раза
en: Parameter with index %d added more than once

source: Параметр не принадлежит текущей коллекции
en: Parameter does not belong to the current collection

source: Элемент коллекции, соответствующий заданному параметру, не найден
en: Collection item matching the specified parameter was not found

source: Указанное значение минимума %f больше значения максимума %f
en: The specified minimum value %f is more than the maximum value %f

source: Неправильный тип аргумента при установке опции '%s' SAX-парсера MSXML
en: Invalid argument type when setting '%s' feature of MSXML SAX parser

source: Указанное значение минимума %d больше значения максимума %d
en: The specified minimum value %d is more than the maximum value %d

source: Параметр не связан с коллекцией
en: Parameter not associated with collection

source: Значение параметра недоступно
en: Parameter value inaccessible

source: Неверный тип данных параметра
en: Invalid parameter data type

source: Количество переданных в функцию расчета значений %d не соответствует количеству параметров %d
en: The count of values %d passed to the calculation function mismatches the count of parameters %d

source: Целевые функции с возвращаемым значением типа %s не поддерживаются методом %s
en: Object functions with return value of %s type are not supported by %s method

source: Реализация метода %s уже зарегистрирована
en: %s method implementation already registered

source: Метод %s не реализован
en: %s method not implemented

source: Метод %s требует дополнительной настройки
en: %s method requires additional configuration

source: Метод %s может проводить оптимизацию только по одному параметру
en: %s method can provide optimization only for a single parameter

source: Неизвестная ошибка при установке опции '%s' SAX-парсера MSXML
en: Unknown error setting '%s' feature of MSXML SAX parser

source: Не задан очередной шаг стратегии
en: Another strategy step not specified

source: Метод %s не поддерживает тип ограничений %s
en: %s method does not support %s constraint type

source: Не удалось найти редактор интерфейса
en: Failed to find interface editor

source: Не удалось найти сопоставление свойства для интерфейса
en: Failed to find property mapping for interface

source: Не задан или удален интерфейс корневого элемента
en: Root element interface not set or removed

source: Типы свойства и переменной не совместимы
en: Property and variable types are not compatible

source: Невозможно присвоить пропущенное значение свойству "%s"
en: Failed to assign null value to "%s" property
